# NotCoveredAtAllByTarget Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..WallJoinRoofFailures..::..NotCoveredAtAllByTarget Property
BuiltInFailures..::..WallJoinRoofFailures Class See Also
---
Highlighted walls are attached to, but miss, the highlighted targets.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NotCoveredAtAllByTarget { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NotCoveredAtAllByTarget As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NotCoveredAtAllByTarget {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..WallJoinRoofFailures Class
Autodesk.Revit.DB Namespace